MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS808/mcu.h
#define U2STA U2STA
extern volatile uint16_t U2STA __attribute__((__sfr__));
__extension__ typedef struct tagU2STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t :1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
      uint16_t :6;
      uint16_t TXINV:1;
    };
  };
} U2STABITS;
extern volatile U2STABITS U2STAbits __attribute__((__sfr__));

#define U2TXREG U2TXREG
extern volatile uint16_t U2TXREG __attribute__((__sfr__));
#define U2RXREG U2RXREG
extern volatile uint16_t U2RXREG __attribute__((__sfr__));
#define U2BRG U2BRG
extern volatile uint16_t U2BRG __attribute__((__sfr__));
#define SPI1CON1 SPI1CON1
extern volatile uint16_t SPI1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON1BITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI1CON1BITS;
extern volatile SPI1CON1BITS SPI1CON1bits __attribute__((__sfr__));

#define SPI1CON1L SPI1CON1L
extern volatile uint16_t SPI1CON1L __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON1LBITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI1CON1LBITS;
extern volatile SPI1CON1LBITS SPI1CON1Lbits __attribute__((__sfr__));

#define SPI1CON1H SPI1CON1H
extern volatile uint16_t SPI1CON1H __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON1HBITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI1CON1HBITS;
extern volatile SPI1CON1HBITS SPI1CON1Hbits __attribute__((__sfr__));

#define SPI1CON2 SPI1CON2
extern volatile uint16_t SPI1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON2BITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI1CON2BITS;
extern volatile SPI1CON2BITS SPI1CON2bits __attribute__((__sfr__));

#define SPI1CON2L SPI1CON2L
extern volatile uint16_t SPI1CON2L __attribute__((__sfr__));
typedef struct tagSPI1CON2LBITS {
  uint16_t WLENGTH:5;
} SPI1CON2LBITS;
extern volatile SPI1CON2LBITS SPI1CON2Lbits __attribute__((__sfr__));

#define SPI1CON3 SPI1CON3
extern volatile uint16_t SPI1CON3 __attribute__((__sfr__));
typedef struct tagSPI1CON3BITS {
  uint16_t WLENGTH:5;
} SPI1CON3BITS;
extern volatile SPI1CON3BITS SPI1CON3bits __attribute__((__sfr__));


/* Generic structure of entire SFR area for each SPI module */
typedef struct tagSPI {
        uint16_t spixstat;
        uint16_t spixcon1;
        uint16_t spixcon2;
        uint16_t unused;
        uint16_t spixbuf;
} SPI, *PSPI;

#define SPIxSTATBITS SPI1STATBITS
#define SPIxCONBITS SPI1CONBITS

#define SPI1 SPI1
extern volatile SPI SPI1 __attribute__((__sfr__));

#define SPI1STATL SPI1STATL
extern volatile uint16_t SPI1STATL __attribute__((__sfr__));
typedef struct tagSPI1STATLBITS {
  uint16_t SPIRBF:1;
  uint16_t SPITBF:1;
  uint16_t :1;
  uint16_t SPITBE:1;
  uint16_t :1;
  uint16_t SPIRBE:1;
  uint16_t SPIROV:1;
  uint16_t SRMT:1;
  uint16_t SPITUR:1;
  uint16_t :2;
  uint16_t SPIBUSY:1;
  uint16_t FRMERR:1;
} SPI1STATLBITS;
extern volatile SPI1STATLBITS SPI1STATLbits __attribute__((__sfr__));


#define SPI1 SPI1
extern volatile SPI SPI1 __attribute__((__sfr__));

#define SPI1STATH SPI1STATH
extern volatile uint16_t SPI1STATH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1STATHBITS {
  union {
    struct {
      uint16_t TXELM:6;
      uint16_t :2;
      uint16_t RXELM:6;
    };
    struct {
      uint16_t TXELM0:1;
      uint16_t TXELM1:1;
      uint16_t TXELM2:1;
      uint16_t TXELM3:1;
      uint16_t TXELM4:1;
      uint16_t TXELM5:1;
      uint16_t :2;
      uint16_t RXELM0:1;
      uint16_t RXELM1:1;
      uint16_t RXELM2:1;
      uint16_t RXELM3:1;
      uint16_t RXELM4:1;
      uint16_t RXELM5:1;
    };
  };
} SPI1STATHBITS;
extern volatile SPI1STATHBITS SPI1STATHbits __attribute__((__sfr__));

#define SPI1BUFL SPI1BUFL
extern volatile uint16_t SPI1BUFL __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFLBITS {
  union {
    struct {
      uint16_t SPI1BUFL:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI1BUFLBITS;
extern volatile SPI1BUFLBITS SPI1BUFLbits __attribute__((__sfr__));

