MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS808/mcu.h
/* PORTE */
#define _RE0 PORTEbits.RE0
#define _RE1 PORTEbits.RE1
#define _RE2 PORTEbits.RE2
#define _RE3 PORTEbits.RE3
#define _RE4 PORTEbits.RE4
#define _RE5 PORTEbits.RE5
#define _RE6 PORTEbits.RE6
#define _RE7 PORTEbits.RE7
#define _RE8 PORTEbits.RE8
#define _RE9 PORTEbits.RE9
#define _RE10 PORTEbits.RE10
#define _RE11 PORTEbits.RE11
#define _RE12 PORTEbits.RE12
#define _RE13 PORTEbits.RE13
#define _RE14 PORTEbits.RE14
#define _RE15 PORTEbits.RE15

/* LATE */
#define _LATE0 LATEbits.LATE0
#define _LATE1 LATEbits.LATE1
#define _LATE2 LATEbits.LATE2
#define _LATE3 LATEbits.LATE3
#define _LATE4 LATEbits.LATE4
#define _LATE5 LATEbits.LATE5
#define _LATE6 LATEbits.LATE6
#define _LATE7 LATEbits.LATE7
#define _LATE8 LATEbits.LATE8
#define _LATE9 LATEbits.LATE9
#define _LATE10 LATEbits.LATE10
#define _LATE11 LATEbits.LATE11
#define _LATE12 LATEbits.LATE12
#define _LATE13 LATEbits.LATE13
#define _LATE14 LATEbits.LATE14
#define _LATE15 LATEbits.LATE15

/* ODCE */
#define _ODCE0 ODCEbits.ODCE0
#define _ODCE1 ODCEbits.ODCE1
#define _ODCE2 ODCEbits.ODCE2
#define _ODCE3 ODCEbits.ODCE3
#define _ODCE4 ODCEbits.ODCE4
#define _ODCE5 ODCEbits.ODCE5
#define _ODCE6 ODCEbits.ODCE6
#define _ODCE7 ODCEbits.ODCE7
#define _ODCE8 ODCEbits.ODCE8
#define _ODCE9 ODCEbits.ODCE9
#define _ODCE10 ODCEbits.ODCE10
#define _ODCE11 ODCEbits.ODCE11
#define _ODCE12 ODCEbits.ODCE12
#define _ODCE13 ODCEbits.ODCE13
#define _ODCE14 ODCEbits.ODCE14
#define _ODCE15 ODCEbits.ODCE15

/* CNENE */
#define _CNIEE0 CNENEbits.CNIEE0
#define _CNIEE1 CNENEbits.CNIEE1
#define _CNIEE2 CNENEbits.CNIEE2
#define _CNIEE3 CNENEbits.CNIEE3
#define _CNIEE4 CNENEbits.CNIEE4
#define _CNIEE5 CNENEbits.CNIEE5
#define _CNIEE6 CNENEbits.CNIEE6
#define _CNIEE7 CNENEbits.CNIEE7
#define _CNIEE8 CNENEbits.CNIEE8
#define _CNIEE9 CNENEbits.CNIEE9
#define _CNIEE10 CNENEbits.CNIEE10
#define _CNIEE11 CNENEbits.CNIEE11
#define _CNIEE12 CNENEbits.CNIEE12
#define _CNIEE13 CNENEbits.CNIEE13
#define _CNIEE14 CNENEbits.CNIEE14
#define _CNIEE15 CNENEbits.CNIEE15

/* CNPUE */
#define _CNPUE0 CNPUEbits.CNPUE0
#define _CNPUE1 CNPUEbits.CNPUE1
#define _CNPUE2 CNPUEbits.CNPUE2
#define _CNPUE3 CNPUEbits.CNPUE3
#define _CNPUE4 CNPUEbits.CNPUE4
#define _CNPUE5 CNPUEbits.CNPUE5
#define _CNPUE6 CNPUEbits.CNPUE6
#define _CNPUE7 CNPUEbits.CNPUE7
#define _CNPUE8 CNPUEbits.CNPUE8
#define _CNPUE9 CNPUEbits.CNPUE9
#define _CNPUE10 CNPUEbits.CNPUE10
#define _CNPUE11 CNPUEbits.CNPUE11
#define _CNPUE12 CNPUEbits.CNPUE12
#define _CNPUE13 CNPUEbits.CNPUE13
#define _CNPUE14 CNPUEbits.CNPUE14
#define _CNPUE15 CNPUEbits.CNPUE15

/* CNPDE */
#define _CNPDE0 CNPDEbits.CNPDE0
#define _CNPDE1 CNPDEbits.CNPDE1
#define _CNPDE2 CNPDEbits.CNPDE2
#define _CNPDE3 CNPDEbits.CNPDE3
#define _CNPDE4 CNPDEbits.CNPDE4
#define _CNPDE5 CNPDEbits.CNPDE5
#define _CNPDE6 CNPDEbits.CNPDE6
#define _CNPDE7 CNPDEbits.CNPDE7
#define _CNPDE8 CNPDEbits.CNPDE8
#define _CNPDE9 CNPDEbits.CNPDE9
#define _CNPDE10 CNPDEbits.CNPDE10
#define _CNPDE11 CNPDEbits.CNPDE11
#define _CNPDE12 CNPDEbits.CNPDE12
#define _CNPDE13 CNPDEbits.CNPDE13
#define _CNPDE14 CNPDEbits.CNPDE14
#define _CNPDE15 CNPDEbits.CNPDE15

/* APPS */
#define _APIFUL APPSbits.APIFUL
#define _APIOV APPSbits.APIOV
#define _APOFUL APPSbits.APOFUL
#define _APOOV APPSbits.APOOV
#define _STRFUL APPSbits.STRFUL


/*----------------------------------------------------------- */
/* Some useful macros for allocating data memory              */
/*----------------------------------------------------------- */

/* The following macros require an argument N that specifies  */
/* alignment. N must a power of two, minimum value = 2.       */
/* For example, to declare an uninitialized array in X memory */
/* that is aligned to a 32 byte address:                      */
/*                                                            */
/* int _XBSS(32) xbuf[16];                                    */
/*                                                            */
#define _XBSS(N)    __attribute__((space(xmemory),aligned(N)))
#define _XDATA(N)   __attribute__((space(xmemory),aligned(N)))
#define _YBSS(N)    __attribute__((space(ymemory),aligned(N)))
#define _YDATA(N)   __attribute__((space(ymemory),aligned(N)))

/* The following macros do not require an argument. They can  */
/* be used to locate a variable in persistent data memory or  */
/* in near data memory. For example, to declare two variables */
/* that retain their values across a device reset:            */
/*                                                            */
/* int _PERSISTENT var1,var2;                                 */
/*                                                            */
#define _PERSISTENT __attribute__((persistent))
#define _NEAR       __attribute__((near))

/* ---------------------------------------------------------- */
/* Some useful macros for declaring functions                 */
/* ---------------------------------------------------------- */

/* The following macros can be used to declare interrupt      */
/* service routines (ISRs). For example, to declare an ISR    */
/* for the timer1 interrupt:                                  */
/*                                                            */
/* void _ISR _T1Interrupt(void);                              */
/*                                                            */
/* To declare an ISR for the SPI1 interrupt with fast         */
/* context save:                                              */
/*                                                            */
/* void _ISRFAST _SPI1Interrupt(void);                        */
/*                                                            */
/* Note: ISRs will be installed into the interrupt vector     */
/* tables automatically if the reserved names listed in the   */
/* MPLAB C30 Compiler User's Guide (DS51284) are used.        */
/*                                                            */
#define _ISR __attribute__((interrupt))
#define _ISRFAST __attribute__((interrupt, shadow))

/* ---------------------------------------------------------- */
/* Some useful macros for changing the CPU IPL                */
/* ---------------------------------------------------------- */

