MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS808/mcu.h
#define _ADFL0CON_OVRSAM_POSITION                0x0000000A
#define _ADFL0CON_OVRSAM_MASK                    0x00001C00
#define _ADFL0CON_OVRSAM_LENGTH                  0x00000003

#define _ADFL0CON_MODE_POSITION                  0x0000000D
#define _ADFL0CON_MODE_MASK                      0x00006000
#define _ADFL0CON_MODE_LENGTH                    0x00000002

#define _ADFL0CON_FLEN_POSITION                  0x0000000F
#define _ADFL0CON_FLEN_MASK                      0x00008000
#define _ADFL0CON_FLEN_LENGTH                    0x00000001

#define _ADFL0CON_FLCHSEL0_POSITION              0x00000000
#define _ADFL0CON_FLCHSEL0_MASK                  0x00000001
#define _ADFL0CON_FLCHSEL0_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL1_POSITION              0x00000001
#define _ADFL0CON_FLCHSEL1_MASK                  0x00000002
#define _ADFL0CON_FLCHSEL1_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL2_POSITION              0x00000002
#define _ADFL0CON_FLCHSEL2_MASK                  0x00000004
#define _ADFL0CON_FLCHSEL2_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL3_POSITION              0x00000003
#define _ADFL0CON_FLCHSEL3_MASK                  0x00000008
#define _ADFL0CON_FLCHSEL3_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL4_POSITION              0x00000004
#define _ADFL0CON_FLCHSEL4_MASK                  0x00000010
#define _ADFL0CON_FLCHSEL4_LENGTH                0x00000001

#define _ADFL0CON_OVRSAM0_POSITION               0x0000000A
#define _ADFL0CON_OVRSAM0_MASK                   0x00000400
#define _ADFL0CON_OVRSAM0_LENGTH                 0x00000001

#define _ADFL0CON_OVRSAM1_POSITION               0x0000000B
#define _ADFL0CON_OVRSAM1_MASK                   0x00000800
#define _ADFL0CON_OVRSAM1_LENGTH                 0x00000001

#define _ADFL0CON_OVRSAM2_POSITION               0x0000000C
#define _ADFL0CON_OVRSAM2_MASK                   0x00001000
#define _ADFL0CON_OVRSAM2_LENGTH                 0x00000001

#define _ADFL1CON_FLCHSEL_POSITION               0x00000000
#define _ADFL1CON_FLCHSEL_MASK                   0x0000001F
#define _ADFL1CON_FLCHSEL_LENGTH                 0x00000005

#define _ADFL1CON_RDY_POSITION                   0x00000008
#define _ADFL1CON_RDY_MASK                       0x00000100
#define _ADFL1CON_RDY_LENGTH                     0x00000001

#define _ADFL1CON_IE_POSITION                    0x00000009
#define _ADFL1CON_IE_MASK                        0x00000200
#define _ADFL1CON_IE_LENGTH                      0x00000001

#define _ADFL1CON_OVRSAM_POSITION                0x0000000A
#define _ADFL1CON_OVRSAM_MASK                    0x00001C00
#define _ADFL1CON_OVRSAM_LENGTH                  0x00000003

#define _ADFL1CON_MODE_POSITION                  0x0000000D
#define _ADFL1CON_MODE_MASK                      0x00006000
#define _ADFL1CON_MODE_LENGTH                    0x00000002

#define _ADFL1CON_FLEN_POSITION                  0x0000000F
#define _ADFL1CON_FLEN_MASK                      0x00008000
#define _ADFL1CON_FLEN_LENGTH                    0x00000001

#define _ADFL1CON_FLCHSEL0_POSITION              0x00000000
#define _ADFL1CON_FLCHSEL0_MASK                  0x00000001
#define _ADFL1CON_FLCHSEL0_LENGTH                0x00000001

#define _ADFL1CON_FLCHSEL1_POSITION              0x00000001
#define _ADFL1CON_FLCHSEL1_MASK                  0x00000002
#define _ADFL1CON_FLCHSEL1_LENGTH                0x00000001

#define _ADFL1CON_FLCHSEL2_POSITION              0x00000002
#define _ADFL1CON_FLCHSEL2_MASK                  0x00000004
#define _ADFL1CON_FLCHSEL2_LENGTH                0x00000001

#define _ADFL1CON_FLCHSEL3_POSITION              0x00000003
#define _ADFL1CON_FLCHSEL3_MASK                  0x00000008
#define _ADFL1CON_FLCHSEL3_LENGTH                0x00000001

#define _ADFL1CON_FLCHSEL4_POSITION              0x00000004
#define _ADFL1CON_FLCHSEL4_MASK                  0x00000010
#define _ADFL1CON_FLCHSEL4_LENGTH                0x00000001

#define _ADFL1CON_OVRSAM0_POSITION               0x0000000A
#define _ADFL1CON_OVRSAM0_MASK                   0x00000400
#define _ADFL1CON_OVRSAM0_LENGTH                 0x00000001

#define _ADFL1CON_OVRSAM1_POSITION               0x0000000B
#define _ADFL1CON_OVRSAM1_MASK                   0x00000800
#define _ADFL1CON_OVRSAM1_LENGTH                 0x00000001

#define _ADFL1CON_OVRSAM2_POSITION               0x0000000C
#define _ADFL1CON_OVRSAM2_MASK                   0x00001000
#define _ADFL1CON_OVRSAM2_LENGTH                 0x00000001

#define _ADTRIG0L_TRGSRC0_POSITION               0x00000000
#define _ADTRIG0L_TRGSRC0_MASK                   0x0000001F
#define _ADTRIG0L_TRGSRC0_LENGTH                 0x00000005

#define _ADTRIG0L_TRGSRC1_POSITION               0x00000008
#define _ADTRIG0L_TRGSRC1_MASK                   0x00001F00
#define _ADTRIG0L_TRGSRC1_LENGTH                 0x00000005

#define _ADTRIG0L_TRIGSRC00_POSITION             0x00000000
#define _ADTRIG0L_TRIGSRC00_MASK                 0x00000001
#define _ADTRIG0L_TRIGSRC00_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC01_POSITION             0x00000001
#define _ADTRIG0L_TRIGSRC01_MASK                 0x00000002
#define _ADTRIG0L_TRIGSRC01_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC02_POSITION             0x00000002
#define _ADTRIG0L_TRIGSRC02_MASK                 0x00000004
#define _ADTRIG0L_TRIGSRC02_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC03_POSITION             0x00000003
#define _ADTRIG0L_TRIGSRC03_MASK                 0x00000008
#define _ADTRIG0L_TRIGSRC03_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC04_POSITION             0x00000004
#define _ADTRIG0L_TRIGSRC04_MASK                 0x00000010
#define _ADTRIG0L_TRIGSRC04_LENGTH               0x00000001

#define _ADTRIG0L_TRGSRC10_POSITION              0x00000008
#define _ADTRIG0L_TRGSRC10_MASK                  0x00000100
#define _ADTRIG0L_TRGSRC10_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC11_POSITION              0x00000009
#define _ADTRIG0L_TRGSRC11_MASK                  0x00000200
#define _ADTRIG0L_TRGSRC11_LENGTH                0x00000001

