MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS808/mcu.h
#define _IPC40_ADCAN20IP_POSITION                0x0000000C
#define _IPC40_ADCAN20IP_MASK                    0x00007000
#define _IPC40_ADCAN20IP_LENGTH                  0x00000003

#define _IPC40_ADCAN17IP0_POSITION               0x00000000
#define _IPC40_ADCAN17IP0_MASK                   0x00000001
#define _IPC40_ADCAN17IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN17IP1_POSITION               0x00000001
#define _IPC40_ADCAN17IP1_MASK                   0x00000002
#define _IPC40_ADCAN17IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN17IP2_POSITION               0x00000002
#define _IPC40_ADCAN17IP2_MASK                   0x00000004
#define _IPC40_ADCAN17IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP0_POSITION               0x00000004
#define _IPC40_ADCAN18IP0_MASK                   0x00000010
#define _IPC40_ADCAN18IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP1_POSITION               0x00000005
#define _IPC40_ADCAN18IP1_MASK                   0x00000020
#define _IPC40_ADCAN18IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP2_POSITION               0x00000006
#define _IPC40_ADCAN18IP2_MASK                   0x00000040
#define _IPC40_ADCAN18IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP0_POSITION               0x00000008
#define _IPC40_ADCAN19IP0_MASK                   0x00000100
#define _IPC40_ADCAN19IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP1_POSITION               0x00000009
#define _IPC40_ADCAN19IP1_MASK                   0x00000200
#define _IPC40_ADCAN19IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP2_POSITION               0x0000000A
#define _IPC40_ADCAN19IP2_MASK                   0x00000400
#define _IPC40_ADCAN19IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP0_POSITION               0x0000000C
#define _IPC40_ADCAN20IP0_MASK                   0x00001000
#define _IPC40_ADCAN20IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP1_POSITION               0x0000000D
#define _IPC40_ADCAN20IP1_MASK                   0x00002000
#define _IPC40_ADCAN20IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP2_POSITION               0x0000000E
#define _IPC40_ADCAN20IP2_MASK                   0x00004000
#define _IPC40_ADCAN20IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP_POSITION                0x00000000
#define _IPC41_ADCAN21IP_MASK                    0x00000007
#define _IPC41_ADCAN21IP_LENGTH                  0x00000003

#define _IPC41_ADCAN21IP0_POSITION               0x00000000
#define _IPC41_ADCAN21IP0_MASK                   0x00000001
#define _IPC41_ADCAN21IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP1_POSITION               0x00000001
#define _IPC41_ADCAN21IP1_MASK                   0x00000002
#define _IPC41_ADCAN21IP1_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP2_POSITION               0x00000002
#define _IPC41_ADCAN21IP2_MASK                   0x00000004
#define _IPC41_ADCAN21IP2_LENGTH                 0x00000001

#define _IPC43_I2C1BCIP_POSITION                 0x00000004
#define _IPC43_I2C1BCIP_MASK                     0x00000070
#define _IPC43_I2C1BCIP_LENGTH                   0x00000003

#define _IPC43_I2C2BCIP_POSITION                 0x00000008
#define _IPC43_I2C2BCIP_MASK                     0x00000700
#define _IPC43_I2C2BCIP_LENGTH                   0x00000003

#define _IPC43_I2C1BCIP0_POSITION                0x00000004
#define _IPC43_I2C1BCIP0_MASK                    0x00000010
#define _IPC43_I2C1BCIP0_LENGTH                  0x00000001

#define _IPC43_I2C1BCIP1_POSITION                0x00000005
#define _IPC43_I2C1BCIP1_MASK                    0x00000020
#define _IPC43_I2C1BCIP1_LENGTH                  0x00000001

#define _IPC43_I2C1BCIP2_POSITION                0x00000006
#define _IPC43_I2C1BCIP2_MASK                    0x00000040
#define _IPC43_I2C1BCIP2_LENGTH                  0x00000001

#define _IPC43_I2C2BCIP0_POSITION                0x00000008
#define _IPC43_I2C2BCIP0_MASK                    0x00000100
#define _IPC43_I2C2BCIP0_LENGTH                  0x00000001

#define _IPC43_I2C2BCIP1_POSITION                0x00000009
#define _IPC43_I2C2BCIP1_MASK                    0x00000200
#define _IPC43_I2C2BCIP1_LENGTH                  0x00000001

#define _IPC43_I2C2BCIP2_POSITION                0x0000000A
#define _IPC43_I2C2BCIP2_MASK                    0x00000400
#define _IPC43_I2C2BCIP2_LENGTH                  0x00000001

#define _IPC44_ADCMP0IP_POSITION                 0x00000004
#define _IPC44_ADCMP0IP_MASK                     0x00000070
#define _IPC44_ADCMP0IP_LENGTH                   0x00000003

#define _IPC44_ADCMP1IP_POSITION                 0x00000008
#define _IPC44_ADCMP1IP_MASK                     0x00000700
#define _IPC44_ADCMP1IP_LENGTH                   0x00000003

#define _IPC44_ADFLTR0IP_POSITION                0x0000000C
#define _IPC44_ADFLTR0IP_MASK                    0x00007000
#define _IPC44_ADFLTR0IP_LENGTH                  0x00000003

#define _IPC44_ADCMP0IP0_POSITION                0x00000004
#define _IPC44_ADCMP0IP0_MASK                    0x00000010
#define _IPC44_ADCMP0IP0_LENGTH                  0x00000001

#define _IPC44_ADCMP0IP1_POSITION                0x00000005
#define _IPC44_ADCMP0IP1_MASK                    0x00000020
#define _IPC44_ADCMP0IP1_LENGTH                  0x00000001

#define _IPC44_ADCMP0IP2_POSITION                0x00000006
#define _IPC44_ADCMP0IP2_MASK                    0x00000040
#define _IPC44_ADCMP0IP2_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP0_POSITION                0x00000008
#define _IPC44_ADCMP1IP0_MASK                    0x00000100
#define _IPC44_ADCMP1IP0_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP1_POSITION                0x00000009
#define _IPC44_ADCMP1IP1_MASK                    0x00000200
#define _IPC44_ADCMP1IP1_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP2_POSITION                0x0000000A
#define _IPC44_ADCMP1IP2_MASK                    0x00000400
#define _IPC44_ADCMP1IP2_LENGTH                  0x00000001

#define _IPC44_ADFLTR0IP0_POSITION               0x0000000C
#define _IPC44_ADFLTR0IP0_MASK                   0x00001000
#define _IPC44_ADFLTR0IP0_LENGTH                 0x00000001

#define _IPC44_ADFLTR0IP1_POSITION               0x0000000D
#define _IPC44_ADFLTR0IP1_MASK                   0x00002000
#define _IPC44_ADFLTR0IP1_LENGTH                 0x00000001

#define _IPC44_ADFLTR0IP2_POSITION               0x0000000E
#define _IPC44_ADFLTR0IP2_MASK                   0x00004000
#define _IPC44_ADFLTR0IP2_LENGTH                 0x00000001

#define _IPC45_ADFLTR1IP_POSITION                0x00000000
#define _IPC45_ADFLTR1IP_MASK                    0x00000007
#define _IPC45_ADFLTR1IP_LENGTH                  0x00000003

#define _IPC45_ADFLTR1IP0_POSITION               0x00000000
#define _IPC45_ADFLTR1IP0_MASK                   0x00000001
#define _IPC45_ADFLTR1IP0_LENGTH                 0x00000001

