MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS808/mcu.h
#define _DMARQC_RQCOL10_POSITION                 0x0000000A
#define _DMARQC_RQCOL10_MASK                     0x00000400
#define _DMARQC_RQCOL10_LENGTH                   0x00000001

#define _DMARQC_RQCOL11_POSITION                 0x0000000B
#define _DMARQC_RQCOL11_MASK                     0x00000800
#define _DMARQC_RQCOL11_LENGTH                   0x00000001

#define _DMARQC_RQCOL12_POSITION                 0x0000000C
#define _DMARQC_RQCOL12_MASK                     0x00001000
#define _DMARQC_RQCOL12_LENGTH                   0x00000001

#define _DMARQC_RQCOL13_POSITION                 0x0000000D
#define _DMARQC_RQCOL13_MASK                     0x00002000
#define _DMARQC_RQCOL13_LENGTH                   0x00000001

#define _DMARQC_RQCOL14_POSITION                 0x0000000E
#define _DMARQC_RQCOL14_MASK                     0x00004000
#define _DMARQC_RQCOL14_LENGTH                   0x00000001

#define _DMAPPS_PPST0_POSITION                   0x00000000
#define _DMAPPS_PPST0_MASK                       0x00000001
#define _DMAPPS_PPST0_LENGTH                     0x00000001

#define _DMAPPS_PPST1_POSITION                   0x00000001
#define _DMAPPS_PPST1_MASK                       0x00000002
#define _DMAPPS_PPST1_LENGTH                     0x00000001

#define _DMAPPS_PPST2_POSITION                   0x00000002
#define _DMAPPS_PPST2_MASK                       0x00000004
#define _DMAPPS_PPST2_LENGTH                     0x00000001

#define _DMAPPS_PPST3_POSITION                   0x00000003
#define _DMAPPS_PPST3_MASK                       0x00000008
#define _DMAPPS_PPST3_LENGTH                     0x00000001

#define _DMAPPS_PPST4_POSITION                   0x00000004
#define _DMAPPS_PPST4_MASK                       0x00000010
#define _DMAPPS_PPST4_LENGTH                     0x00000001

#define _DMAPPS_PPST5_POSITION                   0x00000005
#define _DMAPPS_PPST5_MASK                       0x00000020
#define _DMAPPS_PPST5_LENGTH                     0x00000001

#define _DMAPPS_PPST6_POSITION                   0x00000006
#define _DMAPPS_PPST6_MASK                       0x00000040
#define _DMAPPS_PPST6_LENGTH                     0x00000001

#define _DMAPPS_PPST7_POSITION                   0x00000007
#define _DMAPPS_PPST7_MASK                       0x00000080
#define _DMAPPS_PPST7_LENGTH                     0x00000001

#define _DMAPPS_PPST8_POSITION                   0x00000008
#define _DMAPPS_PPST8_MASK                       0x00000100
#define _DMAPPS_PPST8_LENGTH                     0x00000001

#define _DMAPPS_PPST9_POSITION                   0x00000009
#define _DMAPPS_PPST9_MASK                       0x00000200
#define _DMAPPS_PPST9_LENGTH                     0x00000001

#define _DMAPPS_PPST10_POSITION                  0x0000000A
#define _DMAPPS_PPST10_MASK                      0x00000400
#define _DMAPPS_PPST10_LENGTH                    0x00000001

#define _DMAPPS_PPST11_POSITION                  0x0000000B
#define _DMAPPS_PPST11_MASK                      0x00000800
#define _DMAPPS_PPST11_LENGTH                    0x00000001

#define _DMAPPS_PPST12_POSITION                  0x0000000C
#define _DMAPPS_PPST12_MASK                      0x00001000
#define _DMAPPS_PPST12_LENGTH                    0x00000001

#define _DMAPPS_PPST13_POSITION                  0x0000000D
#define _DMAPPS_PPST13_MASK                      0x00002000
#define _DMAPPS_PPST13_LENGTH                    0x00000001

#define _DMAPPS_PPST14_POSITION                  0x0000000E
#define _DMAPPS_PPST14_MASK                      0x00004000
#define _DMAPPS_PPST14_LENGTH                    0x00000001

#define _DMALCA_LSTCH_POSITION                   0x00000000
#define _DMALCA_LSTCH_MASK                       0x0000000F
#define _DMALCA_LSTCH_LENGTH                     0x00000004

#define _DMALCA_LSTCH0_POSITION                  0x00000000
#define _DMALCA_LSTCH0_MASK                      0x00000001
#define _DMALCA_LSTCH0_LENGTH                    0x00000001

#define _DMALCA_LSTCH1_POSITION                  0x00000001
#define _DMALCA_LSTCH1_MASK                      0x00000002
#define _DMALCA_LSTCH1_LENGTH                    0x00000001

#define _DMALCA_LSTCH2_POSITION                  0x00000002
#define _DMALCA_LSTCH2_MASK                      0x00000004
#define _DMALCA_LSTCH2_LENGTH                    0x00000001

#define _DMALCA_LSTCH3_POSITION                  0x00000003
#define _DMALCA_LSTCH3_MASK                      0x00000008
#define _DMALCA_LSTCH3_LENGTH                    0x00000001

#define _DSADRH_DSADR_POSITION                   0x00000000
#define _DSADRH_DSADR_MASK                       0x000000FF
#define _DSADRH_DSADR_LENGTH                     0x00000008

#define _PTCON_SEVTPS_POSITION                   0x00000000
#define _PTCON_SEVTPS_MASK                       0x0000000F
#define _PTCON_SEVTPS_LENGTH                     0x00000004

#define _PTCON_SYNCSRC_POSITION                  0x00000004
#define _PTCON_SYNCSRC_MASK                      0x00000070
#define _PTCON_SYNCSRC_LENGTH                    0x00000003

#define _PTCON_SYNCEN_POSITION                   0x00000007
#define _PTCON_SYNCEN_MASK                       0x00000080
#define _PTCON_SYNCEN_LENGTH                     0x00000001

#define _PTCON_SYNCOEN_POSITION                  0x00000008
#define _PTCON_SYNCOEN_MASK                      0x00000100
#define _PTCON_SYNCOEN_LENGTH                    0x00000001

#define _PTCON_SYNCPOL_POSITION                  0x00000009
#define _PTCON_SYNCPOL_MASK                      0x00000200
#define _PTCON_SYNCPOL_LENGTH                    0x00000001

#define _PTCON_EIPU_POSITION                     0x0000000A
#define _PTCON_EIPU_MASK                         0x00000400
#define _PTCON_EIPU_LENGTH                       0x00000001

#define _PTCON_SEIEN_POSITION                    0x0000000B
#define _PTCON_SEIEN_MASK                        0x00000800
#define _PTCON_SEIEN_LENGTH                      0x00000001

#define _PTCON_SESTAT_POSITION                   0x0000000C
#define _PTCON_SESTAT_MASK                       0x00001000
#define _PTCON_SESTAT_LENGTH                     0x00000001

#define _PTCON_PTSIDL_POSITION                   0x0000000D
#define _PTCON_PTSIDL_MASK                       0x00002000
#define _PTCON_PTSIDL_LENGTH                     0x00000001

#define _PTCON_PTEN_POSITION                     0x0000000F
#define _PTCON_PTEN_MASK                         0x00008000
#define _PTCON_PTEN_LENGTH                       0x00000001

#define _PTCON_SEVTPS0_POSITION                  0x00000000
#define _PTCON_SEVTPS0_MASK                      0x00000001
#define _PTCON_SEVTPS0_LENGTH                    0x00000001

#define _PTCON_SEVTPS1_POSITION                  0x00000001
#define _PTCON_SEVTPS1_MASK                      0x00000002
#define _PTCON_SEVTPS1_LENGTH                    0x00000001

#define _PTCON_SEVTPS2_POSITION                  0x00000002
#define _PTCON_SEVTPS2_MASK                      0x00000004
#define _PTCON_SEVTPS2_LENGTH                    0x00000001

#define _PTCON_SEVTPS3_POSITION                  0x00000003
#define _PTCON_SEVTPS3_MASK                      0x00000008
#define _PTCON_SEVTPS3_LENGTH                    0x00000001

