MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS808/mcu.h
#define _LATE_LATE9_POSITION                     0x00000009
#define _LATE_LATE9_MASK                         0x00000200
#define _LATE_LATE9_LENGTH                       0x00000001

#define _LATE_LATE10_POSITION                    0x0000000A
#define _LATE_LATE10_MASK                        0x00000400
#define _LATE_LATE10_LENGTH                      0x00000001

#define _LATE_LATE11_POSITION                    0x0000000B
#define _LATE_LATE11_MASK                        0x00000800
#define _LATE_LATE11_LENGTH                      0x00000001

#define _LATE_LATE12_POSITION                    0x0000000C
#define _LATE_LATE12_MASK                        0x00001000
#define _LATE_LATE12_LENGTH                      0x00000001

#define _LATE_LATE13_POSITION                    0x0000000D
#define _LATE_LATE13_MASK                        0x00002000
#define _LATE_LATE13_LENGTH                      0x00000001

#define _LATE_LATE14_POSITION                    0x0000000E
#define _LATE_LATE14_MASK                        0x00004000
#define _LATE_LATE14_LENGTH                      0x00000001

#define _LATE_LATE15_POSITION                    0x0000000F
#define _LATE_LATE15_MASK                        0x00008000
#define _LATE_LATE15_LENGTH                      0x00000001

#define _ODCE_ODCE0_POSITION                     0x00000000
#define _ODCE_ODCE0_MASK                         0x00000001
#define _ODCE_ODCE0_LENGTH                       0x00000001

#define _ODCE_ODCE1_POSITION                     0x00000001
#define _ODCE_ODCE1_MASK                         0x00000002
#define _ODCE_ODCE1_LENGTH                       0x00000001

#define _ODCE_ODCE2_POSITION                     0x00000002
#define _ODCE_ODCE2_MASK                         0x00000004
#define _ODCE_ODCE2_LENGTH                       0x00000001

#define _ODCE_ODCE3_POSITION                     0x00000003
#define _ODCE_ODCE3_MASK                         0x00000008
#define _ODCE_ODCE3_LENGTH                       0x00000001

#define _ODCE_ODCE4_POSITION                     0x00000004
#define _ODCE_ODCE4_MASK                         0x00000010
#define _ODCE_ODCE4_LENGTH                       0x00000001

#define _ODCE_ODCE5_POSITION                     0x00000005
#define _ODCE_ODCE5_MASK                         0x00000020
#define _ODCE_ODCE5_LENGTH                       0x00000001

#define _ODCE_ODCE6_POSITION                     0x00000006
#define _ODCE_ODCE6_MASK                         0x00000040
#define _ODCE_ODCE6_LENGTH                       0x00000001

#define _ODCE_ODCE7_POSITION                     0x00000007
#define _ODCE_ODCE7_MASK                         0x00000080
#define _ODCE_ODCE7_LENGTH                       0x00000001

#define _ODCE_ODCE8_POSITION                     0x00000008
#define _ODCE_ODCE8_MASK                         0x00000100
#define _ODCE_ODCE8_LENGTH                       0x00000001

#define _ODCE_ODCE9_POSITION                     0x00000009
#define _ODCE_ODCE9_MASK                         0x00000200
#define _ODCE_ODCE9_LENGTH                       0x00000001

#define _ODCE_ODCE10_POSITION                    0x0000000A
#define _ODCE_ODCE10_MASK                        0x00000400
#define _ODCE_ODCE10_LENGTH                      0x00000001

#define _ODCE_ODCE11_POSITION                    0x0000000B
#define _ODCE_ODCE11_MASK                        0x00000800
#define _ODCE_ODCE11_LENGTH                      0x00000001

#define _ODCE_ODCE12_POSITION                    0x0000000C
#define _ODCE_ODCE12_MASK                        0x00001000
#define _ODCE_ODCE12_LENGTH                      0x00000001

#define _ODCE_ODCE13_POSITION                    0x0000000D
#define _ODCE_ODCE13_MASK                        0x00002000
#define _ODCE_ODCE13_LENGTH                      0x00000001

#define _ODCE_ODCE14_POSITION                    0x0000000E
#define _ODCE_ODCE14_MASK                        0x00004000
#define _ODCE_ODCE14_LENGTH                      0x00000001

#define _ODCE_ODCE15_POSITION                    0x0000000F
#define _ODCE_ODCE15_MASK                        0x00008000
#define _ODCE_ODCE15_LENGTH                      0x00000001

#define _CNENE_CNIEE0_POSITION                   0x00000000
#define _CNENE_CNIEE0_MASK                       0x00000001
#define _CNENE_CNIEE0_LENGTH                     0x00000001

#define _CNENE_CNIEE1_POSITION                   0x00000001
#define _CNENE_CNIEE1_MASK                       0x00000002
#define _CNENE_CNIEE1_LENGTH                     0x00000001

#define _CNENE_CNIEE2_POSITION                   0x00000002
#define _CNENE_CNIEE2_MASK                       0x00000004
#define _CNENE_CNIEE2_LENGTH                     0x00000001

#define _CNENE_CNIEE3_POSITION                   0x00000003
#define _CNENE_CNIEE3_MASK                       0x00000008
#define _CNENE_CNIEE3_LENGTH                     0x00000001

#define _CNENE_CNIEE4_POSITION                   0x00000004
#define _CNENE_CNIEE4_MASK                       0x00000010
#define _CNENE_CNIEE4_LENGTH                     0x00000001

#define _CNENE_CNIEE5_POSITION                   0x00000005
#define _CNENE_CNIEE5_MASK                       0x00000020
#define _CNENE_CNIEE5_LENGTH                     0x00000001

#define _CNENE_CNIEE6_POSITION                   0x00000006
#define _CNENE_CNIEE6_MASK                       0x00000040
#define _CNENE_CNIEE6_LENGTH                     0x00000001

#define _CNENE_CNIEE7_POSITION                   0x00000007
#define _CNENE_CNIEE7_MASK                       0x00000080
#define _CNENE_CNIEE7_LENGTH                     0x00000001

#define _CNENE_CNIEE8_POSITION                   0x00000008
#define _CNENE_CNIEE8_MASK                       0x00000100
#define _CNENE_CNIEE8_LENGTH                     0x00000001

#define _CNENE_CNIEE9_POSITION                   0x00000009
#define _CNENE_CNIEE9_MASK                       0x00000200
#define _CNENE_CNIEE9_LENGTH                     0x00000001

#define _CNENE_CNIEE10_POSITION                  0x0000000A
#define _CNENE_CNIEE10_MASK                      0x00000400
#define _CNENE_CNIEE10_LENGTH                    0x00000001

